Tranings/Ruby_&_Rails/library_management_system/app/controllers/book_controller.rb

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
---
	def show_details

	  @book = Book.find(params[:id])

INSERT INTO `books` (`book_title`, `price`, `created_at`, `updated_at`, `author`) VALUES ('q', 111111111, '2017-11-28 09:43:06', '2017-11-28 09:43:06', 'q')
---
	def insert_book_form

      Book.create(book_title: params[:book_title], author: params[:author], price: params[:price])