Tranings/Ruby_&_Rails/library_management_system/app/controllers/home_controller.rb

SELECT  `billings`.* FROM `billings` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `billings`
---
	def index

     	@billings = Billing.all.page(params[:page]).per_page(5)